---
layout: post
title: 'নোডজেএস : কোড পরিবর্তনের পর সার্ভার রিলোড করা'
date: 2014-02-27 08:34:12.000000000 +06:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories: []
tags: []
meta:
  _edit_last: '1'
  geo_public: '0'
  _publicize_job_id: '10709905774'
  _publicize_done_external: a:1:{s:7:"twitter";a:1:{i:4514541;s:56:"https://twitter.com/theazharul/status/923105716696768512";}}
  _publicize_done_4607822: '1'
  _wpas_done_4514541: '1'
  publicize_twitter_user: theazharul
  _jetpack_related_posts_cache: a:1:{s:32:"37550b67d263a3ce789993dc25046c5f";a:2:{s:7:"expires";i:1643268234;s:7:"payload";a:5:{i:0;a:1:{s:2:"id";i:7;}i:1;a:1:{s:2:"id";i:194;}i:2;a:1:{s:2:"id";i:109;}i:3;a:1:{s:2:"id";i:123;}i:4;a:1:{s:2:"id";i:68;}}}}
  _thumbnail_id: '241'
  _yoast_wpseo_content_score: '60'
  _yoast_wpseo_estimated-reading-time-minutes: '2'
author: azhar
permalink: "/"
---
<p>আমরা যখন নোডজেএস এ কাজ করি তখন আমাদের কাজগুলো ব্রাউজারে দেখার জন্য নোড সার্ভার চালু রাখতে হয়। নোডজেএসে app.js যদি আমাদের প্রধান ফাইল হয় তাহলে সার্ভার চালু করার জন্য টারমিনালে লিখতে হবে</p>
<pre>node app.js</pre>
<p>কিন্তু আমরা যখন কোন জাভাস্ক্রিপ্ট ফাইলে পরিবর্তন করি তখন সেই পরিবর্তনটি সাথে সাথে ব্রাউজারে দেখতে পাইনা। ব্রাউজারে সেই পরিবর্তনগুলো দেখার জন্য আমাদেরকে নোড সার্ভারটি পুনরায় চালু করতে হয়। এভাবে বারবার নোড সার্ভার চালু করা ডেভেলপারদের জন্য বিরক্তিকর। তবে চিন্তার কিছু নেই। এই অবস্থা থেকে উত্তরণের জন্য নোডের কিছু মডিউল তৈরি করা হয়েছে। যেগুলো সবসময় লক্ষ্য রাখবে সার্ভারে কোন ফাইল পরিবর্তন হচ্ছে কিনা। যদি কোন ফাইল পরিবর্তন হয়ে থাকে তাহলে সে সার্ভারকে পুনরায় চালু করে নেবে। মডিউলগুলোর মধ্যে supervisor এবং nodemon অন্যতম। আমরা এখানে nodemon নিয়ে আলোচনা করবো। তাহলে আর দেরি না করে চলুন দেখে নেই কিভাবে nodemon ইন্সটল ও চালু করতে হয়।</p>
<p>nodemon-কে আপনার সিস্টেমে ইন্সটল করার জন্য টারমিনালে লিখুন-</p>
<pre>npm install nodemon -g</pre>
<p>এতে করে nodemon আপনার কম্পিউটারে ইন্সটল হয়ে যাবে। এখন সেটি চালু করার পালা। nodemon চালু করার জন্য টারমিনালের মাধ্যমে আপনার প্রজেক্ট ডিরেক্টরিতে যান। আপনার প্রজেক্টের মূল ফাইলটি যদি app.js হয় তাহলে টারমিনালে লিখতে হবে-</p>
<pre>nodemon app.js &amp;</pre>
<p>অথবা</p>
<pre>nodemon app &amp;</pre>
<p>ব্যস, আপনার সার্ভার চালু হয়ে গেছে। এখন থেকে আপনি আপনার প্রজেক্টের ফাইলগুলোতে পরিবর্তন করে ব্রাউজার রিলোড দিলেই পরিবর্তনগুলো দেখতে পাবেন।</p>
<p>এখন exit লিখে সার্ভার থেকে লগআউট করলেও আপনার সার্ভারে nodemon সচল থাকবে। তাহলে আর দেরি কেন এখনই আপনার নোড প্রজেক্টে nodemon ইন্সটল করে নিন। :)</p>
<p>কমেন্টে আপনার মতামত লিখতে ভুলবেননা যেনো...</p>
